Autodesk.Revit.DB.ExclusionFilter.GetIdsToExclude
Returns the ids to be excluded by this filter.
Returns:
The collection of ids to exclude.
Since:
2011

Autodesk.Revit.DB.ExclusionFilter.#ctor(System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId})
Constructs a new instance of a filter to exclude elements automatically.
idsToExclude:
The ids to exclude from the results.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input collection of ids was empty, or its contents were not valid for iteration.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.ExclusionFilter
A filter used to exclude a set of elements automatically.
Remarks:
This filter is a quick filter.
Quick filters operate only on the ElementRecord, a low-memory class which has
a limited interface to read element properties. Elements which are rejected
by a quick filter will not be expanded in memory.
Since:
2011